import pandas as pd
import pytest


@pytest.fixture
def my_data():
    data = pd.DataFrame(
        {
            "Дата операции": {
                0: "31.12.2021 19:55:55",
                1: "28.12.2021 18:30:30",
                2: "15.12.2021 07:35:15",
            },
            "Дата платежа": {0: "31.12.2021", 1: "28.12.2021", 2: "15.12.2021"},
            "Номер карты": {0: "*7538", 1: "*4567", 2: "*0003"},
            "Статус": {0: "OK", 1: "OK", 2: "CANCELED"},
            "Сумма операции": {0: -13500, 1: -169, 2: 5000},
            "Категория": {0: "Переводы", 1: "Переводы", 2: "Пополнения"},
            "Описание": {
                0: "Лотков Д.",
                1: "Каршеринг",
                2: "Пополнение через Газпромбанк",
            },
            "Сумма операции с округлением": {0: -13500, 1: -169, 2: 5000},
        }
    )
    return data


@pytest.fixture
def my_data_without_categories():
    data = pd.DataFrame(
        {
            "Дата операции": {
                0: "31.12.2021 19:55:55",
                1: "28.12.2021 18:30:30",
                2: "15.12.2021 07:35:15",
            },
            "Номер карты": {0: "*7538", 1: "*4567", 2: "*0003"},
            "Статус": {0: "OK", 1: "OK", 2: "CANCELED"},
            "Сумма операции": {0: -13500, 1: -169, 2: 5000},
            "Описание": {
                0: "Лотков Д.",
                1: "Каршеринг",
                2: "Пополнение через Газпромбанк",
            },
            "Сумма операции с округлением": {0: -13500, 1: -169, 2: 5000},
        }
    )
    return data


@pytest.fixture
def my_data_dict():
    data = {
        "Дата операции": {
            0: "31.12.2021 19:55:55",
            1: "28.12.2021 18:30:30",
            2: "15.12.2021 07:35:15",
        },
        "Дата платежа": {0: "31.12.2021", 1: "28.12.2021", 2: "15.12.2021"},
        "Номер карты": {0: "*7538", 1: "*4567", 2: "*0003"},
        "Статус": {0: "OK", 1: "OK", 2: "CANCELED"},
        "Сумма операции": {0: -13500, 1: -169, 2: 5000},
        "Категория": {0: "Переводы", 1: "Переводы", 2: "Пополнения"},
        "Описание": {
            0: "Лотков Д.",
            1: "Каршеринг",
            2: "Пополнение через Газпромбанк",
        },
        "Сумма операции с округлением": {0: -13500, 1: -169, 2: 5000},
    }
    return data
