import unittest

import pandas as pd

from src.reports import spending


class TestSpending(unittest.TestCase):

    def test_spending(self):
        data = pd.DataFrame(
            {
                "Дата операции": {
                    0: "31.12.2021 19:55:55",
                    1: "28.12.2021 18:30:30",
                    2: "15.12.2021 07:35:15",
                },
                "Номер карты": {0: "*7538", 1: "*4567", 2: "*0003"},
                "Статус": {0: "OK", 1: "OK", 2: "CANCELED"},
                "Сумма операции": {0: -13500, 1: -169, 2: 5000},
                "Категория": {0: "Переводы", 1: "Переводы", 2: "Пополнения"},
                "Описание": {
                    0: "Лотков Д.",
                    1: "Каршеринг",
                    2: "Пополнение через Газпромбанк",
                },
            }
        )

        result = [
            {
                "Дата операции": "31.12.2021 19:55:55",
                "Категория": "Переводы",
                "Сумма операции": -13500,
            },
            {
                "Дата операции": "28.12.2021 18:30:30",
                "Категория": "Переводы",
                "Сумма операции": -169,
            },
        ]
        assert spending(data, "Переводы", "31.12.2021 23:30:30") == result

        data = pd.DataFrame(
            {
                "Дата операции": {
                    0: "31.12.2021 19:55:55",
                    1: "28.12.2021 18:30:30",
                    2: "15.12.2021 07:35:15",
                },
                "Номер карты": {0: "*7538", 1: "*4567", 2: "*0003"},
                "Статус": {0: "OK", 1: "OK", 2: "CANCELED"},
                "Сумма операции": {0: -13500, 1: -169, 2: 5000},
                "Категория": {0: "Переводы", 1: "Переводы", 2: "Пополнения"},
                "Описание": {
                    0: "Лотков Д.",
                    1: "Каршеринг",
                    2: "Пополнение через Газпромбанк",
                },
            }
        )
        result = []
        assert spending(data, "Переводы") == result

        data = pd.DataFrame(
            {
                "Дата операции": {
                    0: "31.12.2021 19:55:55",
                    1: "28.12.2021 18:30:30",
                    2: "15.12.2021 07:35:15",
                },
                "Номер карты": {0: "*7538", 1: "*4567", 2: "*0003"},
                "Статус": {0: "OK", 1: "OK", 2: "CANCELED"},
                "Сумма операции": {0: -13500, 1: -169, 2: 5000},
                "Категория": {0: "Переводы", 1: "Переводы", 2: "Пополнения"},
                "Описание": {
                    0: "Лотков Д.",
                    1: "Каршеринг",
                    2: "Пополнение через Газпромбанк",
                },
            }
        )
        result = []
        assert spending(data, "Шоколадки", "15.08.2021 15:08:20") == result

        data = pd.DataFrame(
            {
                "Дата операции": {
                    0: "31.12.2021 19:55:55",
                    1: "28.12.2021 18:30:30",
                    2: "15.12.2021 07:35:15",
                },
                "Номер карты": {0: "*7538", 1: "*4567", 2: "*0003"},
                "Статус": {0: "OK", 1: "OK", 2: "CANCELED"},
                "Сумма операции": {0: -13500, 1: -169, 2: 5000},
                "Описание": {
                    0: "Лотков Д.",
                    1: "Каршеринг",
                    2: "Пополнение через Газпромбанк",
                },
            }
        )
        result = []
        assert spending(data, "Супермаркеты", "13.04.2021 17:48:55") == result

        data = pd.DataFrame(
            {
                "Дата операции": {
                    0: "31.12.2021 19:55:55",
                    1: "28.12.2021 18:30:30",
                    2: "15.12.2021 07:35:15",
                },
                "Номер карты": {0: "*7538", 1: "*4567", 2: "*0003"},
                "Статус": {0: "OK", 1: "OK", 2: "CANCELED"},
                "Сумма операции": {0: -13500, 1: -169, 2: 5000},
                "Описание": {
                    0: "Лотков Д.",
                    1: "Каршеринг",
                    2: "Пополнение через Газпромбанк",
                },
            }
        )
        assert spending(data, "test_category", "32.12.2021 17:30:30") == []

        data = pd.DataFrame(
            {
                "Номер карты": {0: "*7538", 1: "*4567", 2: "*0003"},
                "Статус": {0: "OK", 1: "OK", 2: "CANCELED"},
                "Сумма операции": {0: -13500, 1: -169, 2: 5000},
                "Описание": {
                    0: "Лотков Д.",
                    1: "Каршеринг",
                    2: "Пополнение через Газпромбанк",
                },
            }
        )
        assert spending(data, "test_category", "32.12.2021 17:30:30") == []
